var oldd = { 
    namee: 'простой чай',
    black: 'кара чай',
    blue: 'кок  чай',
    red: 'кызыл  чай',
}
var old = prompt ('чай или кофе')
var wow =  ('')
 if (old || ){
    console.log('чай у нас есть', oldd);
}
   var div = prompt ('что хотите заказать')
   var red = 'красный чай стоит 20 сомов'
   var namee = 'простой чай стоит 20 сомов'
   var bluue = 'кок чай стоит 20 сомов'
if (red){
    console.log('ваш заказь был принят ожидайте свой чай',red.namee)
}
else{
    alert('извините такой чаи нету повторите попытку уважамый(-ая)')
}
// извините я не могу сделать ну меню что есть что нет :(
